app/controllers/reviews_controller.rb

  def show
    if (current_user)
    @review = Review.find(params[:id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    if (current_user)
    @review = Review.find(params[:id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", "1"]]

  def create

    puts(params[:review])
    @review = Review.new(params[:review])

    @review.user = current_user

    respond_to do |format|
      if @review.save
---
INSERT INTO `reviews` (`context`, `created_at`, `overall_comments`, `reviewer_id`, `state`, `suggested_drills`, `title`, `updated_at`, `url`, `user_id`) VALUES (NULL, '2011-12-11 19:11:50', NULL, 7, 'Queued', NULL, 'Garcia vs Torres', '2011-12-11 19:11:50', 'http://www.youtube.com/watch?v=eDBqw0ZjBKk', 4)

  def update
    @review = Review.find(params[:id])

    review_attrs = params[:review]

    respond_to do |format|
      if @review.update_attributes(params[:review])

        if (review_attrs[:questions_attributes])
          review_attrs[:questions_attributes].each do |index,question|
            if (question[:answer])
              @question = Question.find(question[:id])
              @question.update_attributes(question)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE `reviews` SET `overall_comments` = 'Can\'t tell who\'s who!', `suggested_drills` = '1.) Ashi garami drill', `state` = 'In Progress', `updated_at` = '2011-12-02 22:55:24' WHERE `reviews`.`id` = 2
SELECT `questions`.* FROM `questions` WHERE `questions`.`review_id` = 2 AND `questions`.`id` IN (2)
UPDATE `questions` SET `0` = '---\n- answer\n- Don\'t try. Just Submit.\n','---\n- id\n- \'3\'\n', `1` = '---\n- answer\n- Pull it off.\n','---\n- id\n- \'4\'\n' WHERE `questions`.`review_id` = 2

  def destroy
    @review = Review.find(params[:id])
    @review.destroy
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 2 LIMIT 1
DELETE FROM `reviews` WHERE `reviews`.`id` = 2