app/controllers/user_registration_controller.rb

  def create
    build_resource

#    resource.roles.build({:role => "Student"})
    student_role = Role.find_all_by_role "Student"
    resource.roles << student_role
---
SELECT `roles`.* FROM `roles` WHERE `roles`.`role` = 'Student'
INSERT INTO `roles` (`created_at`, `role`, `updated_at`) VALUES ('2011-11-20 23:40:24', 'Student', '2011-11-20 23:40:24')