app/views/reviews/_edit_student_form.html.erb


  <% @allUsers = User.all
---
SELECT `users`.* FROM `users`