app/views/reviews/_form.html.erb

SELECT `users`.* FROM `users`
---
  </div>
  <% @allUsers = User.all