app/views/reviews/_new_form.html.erb

  <%= f.label "Select A Reviewer:" %><br></br>
  <% @allUsers = User.all
---
SELECT `users`.* FROM `users`