app/views/reviews/index.html.erb


<% @newlyRequested = Review.where(:reviewer_id => current_user.id) %>
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`reviewer_id` = 7

    <td><%= newReq.state %></td>
    <td><%= newReq.user.first_name + " " + newReq.user.last_name %></td>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1


<% if current_user.reviews.count > 0 %>
---
SELECT COUNT(*) FROM `reviews` WHERE `reviews`.`user_id` = 5
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`user_id` = 2