app/views/reviews/index.html.erb

SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`state` = 'Waiting' AND `reviews`.`reviewer_id` = 1
---

<% @newlyRequested = Review.where(:state => "Waiting", :reviewer_id => current_user.id) %>