app/views/reviews/show.html.erb

<b>Video Reviewer:</b>
<% u = User.find(@review.reviewer_id) %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", "1"]]
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1